In [44]:
import numpy as np
import pandas as pd

## Problem Statement

Read the dataset from the below link
https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv

In [237]:
url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
df = pd.read_csv(url)

In [238]:
print(df.head(40))

    Unnamed: 0     Id       Name  Year Gender State  Count
0        11349  11350       Emma  2004      F    AK     62
1        11350  11351    Madison  2004      F    AK     48
2        11351  11352     Hannah  2004      F    AK     46
3        11352  11353      Grace  2004      F    AK     44
4        11353  11354      Emily  2004      F    AK     41
5        11354  11355    Abigail  2004      F    AK     37
6        11355  11356     Olivia  2004      F    AK     33
7        11356  11357   Isabella  2004      F    AK     30
8        11357  11358     Alyssa  2004      F    AK     29
9        11358  11359     Sophia  2004      F    AK     28
10       11359  11360     Alexis  2004      F    AK     27
11       11360  11361  Elizabeth  2004      F    AK     27
12       11361  11362     Hailey  2004      F    AK     27
13       11362  11363       Anna  2004      F    AK     26
14       11363  11364    Natalie  2004      F    AK     25
15       11364  11365      Sarah  2004      F    AK     25
16       11365  11366     Sydney  2004      F    AK     25
17       11366  11367        Ava  2004      F    AK     23
18       11367  11368    Trinity  2004      F    AK     22
19       11368  11369      Haley  2004      F    AK     21
20       11369  11370     Kaylee  2004      F    AK     21
21       11370  11371     Taylor  2004      F    AK     21
22       11371  11372      Chloe  2004      F    AK     20
23       11372  11373       Ella  2004      F    AK     20
24       11373  11374  Mackenzie  2004      F    AK     20
25       11374  11375     Sierra  2004      F    AK     19
26       11375  11376      Kayla  2004      F    AK     18
27       11376  11377   Samantha  2004      F    AK     18
28       11377  11378        Zoe  2004      F    AK     18
29       11378  11379    Jessica  2004      F    AK     17
30       11379  11380       Leah  2004      F    AK     17
31       11380  11381       Lily  2004      F    AK     17
32       11381  11382     Rachel  2004      F    AK     17
33       11382  11383      Riley  2004      F    AK     17
34       11383  11384   Savannah  2004      F    AK     17
35       11384  11385   Victoria  2004      F    AK     17
36       11385  11386     Ashley  2004      F    AK     16
37       11386  11387    Cadence  2004      F    AK     16
38       11387  11388      Megan  2004      F    AK     16
39       11388  11389     Aurora  2004      F    AK     15

## Problem 1

Delete unnamed columns

In [239]:
df.drop('Unnamed: 0', axis = 1, inplace = True)

In [240]:
df.drop('Id', axis = 1, inplace = True)

In [241]:
print(df.head(40))

         Name  Year Gender State  Count
0        Emma  2004      F    AK     62
1     Madison  2004      F    AK     48
2      Hannah  2004      F    AK     46
3       Grace  2004      F    AK     44
4       Emily  2004      F    AK     41
5     Abigail  2004      F    AK     37
6      Olivia  2004      F    AK     33
7    Isabella  2004      F    AK     30
8      Alyssa  2004      F    AK     29
9      Sophia  2004      F    AK     28
10     Alexis  2004      F    AK     27
11  Elizabeth  2004      F    AK     27
12     Hailey  2004      F    AK     27
13       Anna  2004      F    AK     26
14    Natalie  2004      F    AK     25
15      Sarah  2004      F    AK     25
16     Sydney  2004      F    AK     25
17        Ava  2004      F    AK     23
18    Trinity  2004      F    AK     22
19      Haley  2004      F    AK     21
20     Kaylee  2004      F    AK     21
21     Taylor  2004      F    AK     21
22      Chloe  2004      F    AK     20
23       Ella  2004      F    AK     20
24  Mackenzie  2004      F    AK     20
25     Sierra  2004      F    AK     19
26      Kayla  2004      F    AK     18
27   Samantha  2004      F    AK     18
28        Zoe  2004      F    AK     18
29    Jessica  2004      F    AK     17
30       Leah  2004      F    AK     17
31       Lily  2004      F    AK     17
32     Rachel  2004      F    AK     17
33      Riley  2004      F    AK     17
34   Savannah  2004      F    AK     17
35   Victoria  2004      F    AK     17
36     Ashley  2004      F    AK     16
37    Cadence  2004      F    AK     16
38      Megan  2004      F    AK     16
39     Aurora  2004      F    AK     15

## Problem 2

Show the distribution of male and female

In [242]:
male_v_female = pd.value_counts(df['Gender'])
print(male_v_female)

F    558846
M    457549
Name: Gender, dtype: int64

## Problem 3

Show the top 5 most preferred names

In [244]:
sumnames = df.groupby('Name').sum()
print(sumnames.head(10))

           Year  Count
Name
Aaban      4027     12
Aadan      8039     23
Aadarsh    2009      5
Aaden    393963   3426
Aadhav     2014      6
Aadhya    80515    453
Aadi      76340    307
Aadin      2008      5
Aadit      6029     18
Aaditya   28116     97

In [245]:
# Year is not necessary so going to drop the column
df.drop('Year', axis = 1, inplace = True)

In [247]:
sumnames = df.groupby('Name').sum()
print(sumnames.head(10))

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6
Aadhya     453
Aadi       307
Aadin        5
Aadit       18
Aaditya     97

In [217]:
topnames = sumnames.sort_values('Count', ascending = False) 
print(topnames.head(5))

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

## Problem 4

What is the median name occurence in the dataset

In [218]:
mediannames = sumnames[sumnames.Count == sumnames.Count.median()]
print(mediannames)

            Count
Name
Aishani        49
Alara          49
Alysse         49
Ameir          49
Anely          49
Antonina       49
Aveline        49
Aziah          49
Baily          49
Caleah         49
Carlota        49
Cristine       49
Dahlila        49
Darvin         49
Deante         49
Deserae        49
Devean         49
Elizah         49
Emmaly         49
Emmanuela      49
Envy           49
Esli           49
Fay            49
Gurshaan       49
Hareem         49
Iven           49
Jaice          49
Jaiyana        49
Jamiracle      49
Jelissa        49
...           ...
Kyndle         49
Kynsley        49
Leylanie       49
Maisha         49
Malillany      49
Mariann        49
Marquell       49
Maurilio       49
Mckynzie       49
Mehdi          49
Nabeel         49
Nalleli        49
Nassir         49
Nazier         49
Nishant        49
Rebecka        49
Reghan         49
Ridwan         49
Riot           49
Rubin          49
Ryatt          49
Sameera        49
Sanjuanita     49
Shalyn         49
Skylie         49
Sriram         49
Trinton        49
Vita           49
Yoni           49
Zuleima        49

[66 rows x 1 columns]

## Problem 5

Distribution of male and female born count by states

In [235]:
male_v_female_bystates = df.groupby(['State', 'Gender'])
print((male_v_female_bystates.size().unstack()))

Gender      F      M
State
AK       2404   2587
AL       9878   8419
AR       7171   6475
AZ      14518  10820
CA      45144  31637
CO      11424   9183
CT       6575   5733
DC       3053   3000
DE       2549   2440
FL      25781  20070
GA      19385  15454
HI       3255   3546
IA       7131   6307
ID       4918   4833
IL      21268  16828
IN      13056  10613
KS       7753   6748
KY       8817   7267
LA      10510   9676
MA      10580   8609
MD      11276   9483
ME       2976   2777
MI      16038  13243
MN      10677   9004
MO      11948   9917
MS       7235   6862
MT       2690   2986
NC      17357  13530
ND       2399   2581
NE       5370   5029
NH       2957   2659
NJ      15041  12274
NM       5721   4966
NV       7092   6024
NY      28158  22585
OH      18143  14318
OK       9519   8138
OR       8604   7333
PA      17480  14171
RI       2558   2468
SC       9465   8195
SD       2838   2908
TN      13063  10588
TX      39760  27791
UT       9515   8233
VA      14759  11997
VT       1398   1618
WA      13329  11049
WI      10549   8940
WV       4305   3733
WY       1456   1904

In [261]:
male_v_female_bystates = df.pivot_table(index = 'Gender', columns = 'State', values = 'Count', aggfunc = 'count')
print((male_v_female_bystates.unstack()))

State  Gender
AK     F          2404
       M          2587
AL     F          9878
       M          8419
AR     F          7171
       M          6475
AZ     F         14518
       M         10820
CA     F         45144
       M         31637
CO     F         11424
       M          9183
CT     F          6575
       M          5733
DC     F          3053
       M          3000
DE     F          2549
       M          2440
FL     F         25781
       M         20070
GA     F         19385
       M         15454
HI     F          3255
       M          3546
IA     F          7131
       M          6307
ID     F          4918
       M          4833
IL     F         21268
       M         16828
                 ...
OK     F          9519
       M          8138
OR     F          8604
       M          7333
PA     F         17480
       M         14171
RI     F          2558
       M          2468
SC     F          9465
       M          8195
SD     F          2838
       M          2908
TN     F         13063
       M         10588
TX     F         39760
       M         27791
UT     F          9515
       M          8233
VA     F         14759
       M         11997
VT     F          1398
       M          1618
WA     F         13329
       M         11049
WI     F         10549
       M          8940
WV     F          4305
       M          3733
WY     F          1456
       M          1904
Length: 102, dtype: int64